# `titanicüö¢üßäüåä`

In [1]:
# -q (quiet) ÏòµÏÖòÏùÄ ÏÑ§Ïπò Î°úÍ∑∏Î•º ÏïàÎ≥¥Ïó¨Ï§å(Ï°∞Ïö©ÌûàÌï®)
%pip install -q seaborn

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
# ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ÏÖã Î∂àÎü¨Ïò§Í∏∞
# (pandasÏóê Í∏∞Î≥∏ ÎÇ¥Ïû•Îêú ÏòàÏ†ú Îç∞Ïù¥ÌÑ∞ÏÖã)
import seaborn as sns
import pandas as pd

# titanic Îç∞Ïù¥ÌÑ∞ DataFrame
titanic = sns.load_dataset('titanic')

# Ï≤òÏùå 5Í∞ú Ìñâ Î≥¥Í∏∞
print("ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ ÎØ∏Î¶¨Î≥¥Í∏∞:")
print(titanic.head())

# Îç∞Ïù¥ÌÑ∞ÏÖã Ï†ïÎ≥¥ ÌôïÏù∏
print("\nÎç∞Ïù¥ÌÑ∞ÏÖã Ï†ïÎ≥¥:")
print(titanic.info())

# Îç∞Ïù¥ÌÑ∞ ÏöîÏïΩ ÌÜµÍ≥Ñ
print("\nÎç∞Ïù¥ÌÑ∞ ÏöîÏïΩ ÌÜµÍ≥Ñ:")
print(titanic.describe())

ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ ÎØ∏Î¶¨Î≥¥Í∏∞:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

Îç∞Ïù¥ÌÑ∞ÏÖã Ï†ïÎ≥¥:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

Îç∞Ïù¥ÌÑ∞ ÏöîÏïΩ ÌÜµÍ≥Ñ:
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [3]:
# ColÎ≥Ñ Í≤∞Ï∏°Ïπò Ìï©Í≥Ñ
titanic.isna().sum()
# ÏäπÍ∞ù Îì±Í∏â Îì±Ïû• ÎπàÎèÑ (1, 2, 3 Îì±ÏÑù)
titanic['pclass'].value_counts()
# ÏÑ±Î≥Ñ ÎπàÎèÑ (ÎÇ® / ÎÖÄ)
titanic['sex'].value_counts()
# ÏÉùÏ°¥ Ïó¨Î∂Ä ÎπàÎèÑ (ÏÉùÏ°¥Ïûê / ÏÇ¨ÎßùÏûê)
titanic['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [4]:
# ÏÑ±Î≥ÑÏóê Îî∞Î•∏ ÏÉùÏ°¥Ïú®
titanic.groupby('sex')['survived'].mean()
# Îçî Î≥µÏû°Ìïú ÌÜµÍ≥Ñ Í∞ÄÎä•
titanic.groupby('sex').agg({'survived': ['mean']})

# ÏäπÍ∞ù Îì±Í∏âÏóê Îî∞Î•∏ ÏÉùÏ°¥Ïú®
titanic.groupby('pclass')['survived'].mean()

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [5]:
# ÏÑ±Î≥Ñ & ÏäπÍ∞ù Îì±Í∏âÏóê Îî∞Î•∏ ÏÉùÏ°¥
titanic.groupby(['sex', 'pclass'])['survived'].mean()
# ÌîºÎ≤óÌÖåÏù¥Î∏î
titanic.pivot_table(
    values='survived',
    index='sex',
    columns='pclass',
    aggfunc='mean'
)

# ÎÇòÏù¥ Í∑∏Î£πÎ≥Ñ ÏÉùÏ°¥Ïú®
titanic['age_group'] = pd.cut(
    titanic['age'],
    bins=[0, 12, 18, 35, 60, 100],  # Ï¥àÍ≥º ~ Ïù¥Ìïò
    labels=['ÏïÑÎèô', 'Ï≤≠ÏÜåÎÖÑ', 'Ï≤≠ÎÖÑ', 'Ï§ëÏû•ÎÖÑ', 'ÎÖ∏ÎÖÑ']
)

titanic.head()

# Ïπ¥ÌÖåÍ≥†Î¶¨Í∞Ä ÏûàÎäîÎç∞, Ìï¥ÎãπÎêòÎäî ÎÇ¥Ïö©Ïù¥ ÏóÜÏùÑ Îïå => ÌëúÏãúÌïúÎã§ / Ïïà ÌïúÎã§ (observed ÏòµÏÖò; False / True)
titanic.groupby('age_group', observed=True)['survived'].mean()

# ÏÑ±Î≥Ñ + ÎÇòÏù¥Í∑∏Î£πÏúºÎ°ú ÏÉùÏ°¥Ïú® ÌôïÏù∏
titanic.groupby(['sex', 'age_group'])['survived'].mean()
# ÌîºÎ≤óÌÖåÏù¥Î∏î
titanic.pivot_table(
    values='survived',
    index='sex',
    columns='age_group',
    aggfunc='mean'
)

C:\Users\sec\AppData\Local\Temp\ipykernel_185280\1217555871.py:24: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(['sex', 'age_group'])['survived'].mean()
C:\Users\sec\AppData\Local\Temp\ipykernel_185280\1217555871.py:26: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table(

age_group        ÏïÑÎèô       Ï≤≠ÏÜåÎÖÑ        Ï≤≠ÎÖÑ       Ï§ëÏû•ÎÖÑ        ÎÖ∏ÎÖÑ
sex
female     0.593750  0.750000  0.783333  0.771429  1.000000
male       0.567568  0.088235  0.180672  0.192000  0.105263

In [6]:
titanic= sns.load_dataset('titanic')
# Í≤∞Ï∏°Ïπò ÌôïÏù∏
missing = titanic.isna().sum()
# Í≤∞Ï∏° ÏûàÎäî Ìï≠Î™©Îßå ÌôïÏù∏
missing[missing > 0]

# Í≤∞Ï∏° ÎπÑÏú®
missing_p = titanic.isna().mean() * 100
missing_p[missing_p > 0]

age            19.865320
embarked        0.224467
deck           77.216611
embark_town     0.224467
dtype: float64

In [7]:
# Í≤∞Ï∏°Ïπò Ï±ÑÏö∞Í∏∞
# age: Ï§ëÏöîÌïú Ï†ïÎ≥¥ : ÌèâÍ∑†/Ï§ëÏïôÍ∞í ÎåÄÏ≤¥
# embarked: Í∞ÄÏû• ÎßéÏùÄ ÏÇ¨ÎûåÎì§Ïù¥ ÌÉÑ Í≥≥ÏúºÎ°ú ÎåÄÏ≤¥
# deck: Ï∂îÏ∏° Î∂àÍ∞ÄÎä•(ÏùòÎØ∏ ÏóÜÏùå) -> ÏÇ≠Ï†ú

# ÌïÑÏöîÌïòÎã§Î©¥, copy Îñ†ÏÑú ÏßÑÌñâ
titanic_processed = titanic.copy()

# ÎπÑÏñ¥ÏûàÎçò Ìñâ ÎßàÏä§ÌÇπ
age_mask = titanic['age'].isna()

# ÎÇòÏù¥ Í≤∞Ï∏°Ïπò Ï±ÑÏö∞Í∏∞ (ÎÇ®ÎÖÄ ÏÉÅÍ¥ÄÏóÜÏù¥ Ï†ÑÏ≤¥ ÌèâÍ∑†ÏúºÎ°ú Ï±ÑÏõÄ)
mean_age = titanic['age'].mean()
titanic_processed['age'] = titanic['age'].fillna(mean_age)

# Í≤∞Ï∏°Ïπò ÏûàÎäîÏßÄ Ïû¨ÌôïÏù∏
titanic_processed.isna().sum()

# ÌèâÍ∑†ÏúºÎ°ú Ï±ÑÏõåÏßÑ Í∞íÎì§Îßå ÌôïÏù∏
titanic_processed.loc[age_mask]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,29.699118,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,29.699118,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,29.699118,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,29.699118,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,29.699118,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,29.699118,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,29.699118,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,29.699118,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [8]:
# Ï†ÑÏ≤¥ ÌèâÍ∑†ÏúºÎ°ú ÎåÄÏ≤¥ÌïòÎäî Í≤å Ïò≥ÏùÑÍπå..?
# ÏÑ±Î≥Ñ / Í∞ùÏã§ Î≥ÑÎ°ú ÌèâÍ∑†ÏùÑ Ï∂îÏ†ïÌïòÎäî Í±¥ ?

# Î™®Îì† ÏÇ¨ÎûåÎì§ÏùÑ ÏÑ±Î≥Ñ / Í∞ùÏã§ Í∑∏Î£πÏùò ÌèâÍ∑† ÎÇòÏù¥Î°ú Î∞îÍæº Series
mean_ages = titanic.groupby(['sex', 'pclass'])['age'].transform('mean')

# titanicÏùò age col Ï§ë Îπà Í∞íÎßå, mean_agesÎ°ú Ï±ÑÏõÄ.
titanic_processed['age'] = titanic['age'].fillna(mean_ages)

# ÏõêÎûò ÎπÑÏñ¥ÏûàÎçò Ïï†Îì§Îßå ÌôïÏù∏
titanic_processed.loc[titanic['age'].isna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,26.507589,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,30.740707,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,21.750000,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,26.507589,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,21.750000,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,26.507589,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,21.750000,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,26.507589,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,26.507589,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,21.750000,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [9]:
# embarked (ÌÉëÏäπ ÎèÑÏãú) -> ÏµúÎπàÍ∞í(Í∞ÄÏû• ÎßéÏù¥ ÌÉÑ Í≥≥)

#ÎπÑÏñ¥ÏûàÎäî Ìï≠Íµ¨ Í∞úÏàò
titanic['embarked'].isna().sum()

# ÏµúÎπàÍ∞í (Series - Î≤°ÌÑ∞)
mode_embarked = titanic['embarked'].mode()[0]  # SeriesÏóêÏÑú 1Í∞ú ÎΩëÍ∏∞

# Îπà Í∞íÏùÄ ÏµúÎπàÍ∞íÏúºÎ°ú ÍµêÏ≤¥
titanic_processed['embarked'] = titanic['embarked'].fillna(mode_embarked)

# Ï≤òÎ¶¨ ÏôÑÎ£å ÌôïÏù∏ (ÎπàÍ∞í 0Í∞ú)
titanic_processed['embarked'].isna().sum()

np.int64(0)

In [10]:
# deckÏùÄ 77%Í∞Ä ÎπÑÏñ¥ÏûàÏùå -> ÏÇ≠Ï†ú
titanic['deck'].isna().mean() * 100  # Îπà Í∞í ÎπÑÏú®

# 'deck' Ïª¨ÎüºÏùÄ ÏÇ≠Ï†ú - inplaceÎäî Ïã§ÌñâÌïòÎ©¥, 2Î≤àÏß∏ Ïã§Ìñâ Î∂àÍ∞ÄÎä•
titanic_processed.drop('deck', axis=1, inplace=True)

In [11]:
titanic_processed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB